[{"Level":"0","PostID":"1","UserID":"a001","Heading":"General","Content":"This tread is here to ask questions of administrative type. Be careful not to ask a question if the specific question is already answered in the study guide or in an announcement on the CS website.****** If your question relates to a personal matter, for example missing marks, it should rather be sent to cos132queries AT cs.up.ac.za.","ParentPostID":"0","TimeStamp":"2013/02/26 10:27"},{"Level":"0","PostID":"2","UserID":"a001","Heading":"Practical Assignments","Content":"We will start a new thread for each practical. When there is not yet a thead for a specific task for which you want to make a comment or ask a question, please feel free to start a theraed for the specific task.******If your post is not about a specific task, post it in the general thread.","ParentPostID":"0","TimeStamp":"2013/02/26 10:30"},{"Level":"0","PostID":"3","UserID":"a001","Heading":"Fitchfork","Content":"Fitchfork is the name of the automatic assessment system which is used to mark the programming assignments in this module. We invite  you to discuss aspects of the system here.","ParentPostID":"0","TimeStamp":"2013/02/26 11:17"},{"Level":"1","PostID":"4","UserID":"a002","Heading":"Language issue","Content":"I am trying to send a post through but Honey system keeps saying I am using SMS language when I am not. Any ideas how to get round this? The filter seem to be very sensitive.***","ParentPostID":"1","TimeStamp":"2013/02/27 10:27"},{"Level":"1","PostID":"5","UserID":"a002","Heading":"PS - additional to previous post","Content":"I meant to add to the previous post that I had weblinks in my text. If anyone needs advice on SCITE and GCC installation on your home machines, let me know. I found the solution.","ParentPostID":"1","TimeStamp":"2013/02/27 10:30"},{"Level":"1","PostID":"6","UserID":"a003","Heading":"USB ports problem","Content":"I have a laptop with 3 usb ports that worked perfectly until i borrowed it to a friend who is not computer literate.He didnt insert or remove a usb from any of the usb ports but now none of them work . Does anyone know what could have happened ?","ParentPostID":"1","TimeStamp":"2013/02/27 11:17"},{"Level":"1","PostID":"7","UserID":"a004","Heading":"C++ Issues","Content":"Many of us have not programmed before. Those of you who know should tell us what to watch out for","ParentPostID":"1","TimeStamp":"2013/02/27 13:30"},{"Level":"2","PostID":"8","UserID":"a005","Heading":"Boolean","Content":"Hello******In Turbo Delphi if you used a Boolean (data type) and you did not assign a true or false value to the Boolean variable, the variable was default true.  In C++ I read that true has the value 1 and false has the value 0, but what is the default value?******Kind regards","ParentPostID":"7","TimeStamp":"2013/02/27 13:47"},{"Level":"3","PostID":"9","UserID":"a006","Heading":"At Boolean","Content":"Hi Frank******According to me the default value for a boolean variable in C++ is true.******Kind regards, hope this helps.","ParentPostID":"8","TimeStamp":"2013/02/27 13:55"},{"Level":"1","PostID":"10","UserID":"a007","Heading":"Profile Look?","Content":"Why can't we attach a picture to our profiles? Shouldn't we be able to customize our profiles a bit more so that we can show a bit more about ourselves rather than just showing a name and date posted?","ParentPostID":"1","TimeStamp":"2013/02/27 14:03"},{"Level":"2","PostID":"11","UserID":"a008","Heading":"Delphi Integer vs C++ Double","Content":"In Delphi we declared variables that stored numbers as Integers, where in C++ coding we are advised to declare numbers as Double since it adds a decimal point. I just do not understand this since I know Integers do exist in C++, and since the programmers design the program to lead the user in what type of input is required. Using good coding techniques to ensure that failures do not occur, the type of data that is put in through the user will be forced to be correct.","ParentPostID":"7","TimeStamp":"2013/02/27 14:10"},{"Level":"3","PostID":"12","UserID":"a005","Heading":"Reply @  Delphi Integer vs C++ Double","Content":"Hello Sir******According to my knowledge the Double data type is useful because of the large amount of decimals it can store (12 decimals).******You do not have to use the Double data type when you are doing calculations with integers and the answer is going to be an integer.******You can also use the data type float for calculations where the answer is going to include decimals.  (Float can't store as much decimals as Double)******Kind regards","ParentPostID":"11","TimeStamp":"2013/02/27 14:20"},{"Level":"2","PostID":"13","UserID":"a009","Heading":"Background information about C++","Content":"In the 1980's C++, being a programming language wich is object oriented, was derived from C, and is widely being used in the programming industry. The reason C++ is so popular, is the fact that it is fast, and not at the highest difficulty level to understand. C++ had an influence on C# as well as Java.******Regards","ParentPostID":"7","TimeStamp":"2013/02/27 14:23"},{"Level":"3","PostID":"14","UserID":"a010","Heading":"Boolean","Content":"@Frank******Remember that bool is a built in type, just as int and double... ect.***This means that declaring a variable does not give it a specific value. Its value is undefined. The value of the variable is basically garbage.***If you where to print the","ParentPostID":"8","TimeStamp":"2013/02/27 15:38"},{"Level":"2","PostID":"15","UserID":"a011","Heading":"RE: Delphi Integer vs C++ Double","Content":"At this moment in time, especially for those who have never programmed before, we declare variables as a \"double\" datatype because it's safer to do that than using integer variables. Depending on the program, we would require to write some validation to ensure the user doesn't type in a number with decimals.","ParentPostID":"7","TimeStamp":"2013/02/27 16:12"},{"Level":"1","PostID":"16","UserID":"a012","Heading":"Admin advice","Content":"The layout of the honey discussions is somehow confusing.We are only allowed to post or start topics in the general, or fitchfork slot.Everyone who is in the discussion is part of the university so I will assume security excuses are invalid.******The layout has no problem, but as we post more comments the list of topics will increase and information will no more be easy to find.To avoid that, if we are given the permission to start a topic, it will be easier to find a slot with relevent information.","ParentPostID":"1","TimeStamp":"2013/02/27 16:24"},{"Level":"2","PostID":"17","UserID":"a013","Heading":"Strings In C++","Content":"If you have programmed in the past already it could be that you have used the plus sign to conctenate (or put together) strings. With us it is not the same as you will get errors when compiling your unit. When you are concatenating strings you should use the string extraction operator which looks like <<***Happy Programming!","ParentPostID":"7","TimeStamp":"2013/02/27 16:28"},{"Level":"2","PostID":"18","UserID":"a014","Heading":"Static_cast","Content":"Can someone please explain to me what is the meaning of the function (static_cast<>). What does this function do and where in the coding do you insert it?******I would highly appreciate it if someone could help me.***Thanks :)","ParentPostID":"7","TimeStamp":"2013/02/27 16:30"},{"Level":"3","PostID":"19","UserID":"a013","Heading":"Static_cast","Content":"@Ms Venter******The \"static_cast\" operator is to state to the compiler that the value you enter should be put together in a datatype that you specify.***The operator works like follow:***static_cast<specified datatype>(value);******for example: ******doub","ParentPostID":"18","TimeStamp":"2013/02/27 16:37"},{"Level":"3","PostID":"20","UserID":"a014","Heading":"Strings In C++","Content":"@ Mr. Evans***Thanks for the advice. I programmed before and the output really confused me for some reason.","ParentPostID":"17","TimeStamp":"2013/02/27 16:37"},{"Level":"2","PostID":"21","UserID":"a015","Heading":"\"-Wall or -Werror","Content":"Good afternoon everyone******When creating the makefile, is it best to use both the -Wall and -Werror or is -Wall just as sufficient? ***","ParentPostID":"7","TimeStamp":"2013/02/27 17:47"},{"Level":"1","PostID":"22","UserID":"a016","Heading":"Telkom internet users warning","Content":"To all Telkom capped ADSL subscribers:******Telkom has introduced soft-cap (which means uncapped, but at lower speeds after you pass your \"normal cap\"). When your \"normal cap\" runs out, you will have to login to the Usage Tracker and activate your soft-cap (or buy more cap). ******The usage tracker website has been down since yesterday, in other words if you get capped now, you can't access the internet at all. Which means you can't upload any practicals, use the CS website, or access ClickUP from home. ***Kind regards******Anrich","ParentPostID":"1","TimeStamp":"2013/02/28 10:29"},{"Level":"2","PostID":"23","UserID":"a017","Heading":"RE: Admin Advice","Content":"I completly agree with that notion. Why arent we allowed to start our own threads that focus on a specific topic?? Now you have people talking about Win8, Linux, Delphi, Telkom etc all in one thread.","ParentPostID":"22","TimeStamp":"2013/02/28 10:47"},{"Level":"3","PostID":"24","UserID":"a018","Heading":"Re: -Wall or -Werror","Content":"To Ms Mathebula******The -Wall flag will warn you that there may be something wrong with your program. ***Even if there is a warning your pragram wil completely compile and it may even run sucesfully******The -Werror will cause your program to stop compiling until you have fixed it. Your program will not be able to run until you have eliminated all the errors (warnings now shown as errors and real errors)******When I test my program I use both -Wall and -Werror. But I don't use either in my makefile I upload.","ParentPostID":"21","TimeStamp":"2013/02/28 10:51"},{"Level":"1","PostID":"25","UserID":"a019","Heading":"general progress of the course","Content":"I wanted to find out how are people finding COS132? I have learn't that it requires a lot of time espicially when doing practicals and what to find out how others are copying.","ParentPostID":"1","TimeStamp":"2013/02/28 12:09"},{"Level":"2","PostID":"26","UserID":"a020","Heading":"Header Files","Content":"I am reading chapter 3, Input/Output; and came across a section where they talk about using for example, math functions from the header file cmath. The notation used for this is #include <cmath>. I'd like to know whether one must have the #include for every function used in a particular program?","ParentPostID":"7","TimeStamp":"2013/02/28 13:01"},{"Level":"1","PostID":"27","UserID":"a021","Heading":"honey is for marks?","Content":"Great idea, cos 132 is awesome","ParentPostID":"1","TimeStamp":"2013/02/28 13:50"},{"Level":"1","PostID":"28","UserID":"a022","Heading":"using linux instead of  windows excel","Content":"When doing online practicals that require graphing and sorting out data,is it possible to use the Linux pack instead of excel ?","ParentPostID":"1","TimeStamp":"2013/02/28 13:59"},{"Level":"3","PostID":"29","UserID":"a023","Heading":"RE: static_cast use","Content":"I also had a problem with that for a while, and the textbook was confusing me too. As far as I can see, it's [ static_cast<int or double - depending on what value you want to convert to>(what you want to convert - usually a variable) ] ******I think you add it into outpu directly, as in after cout.","ParentPostID":"18","TimeStamp":"2013/02/28 14:38"},{"Level":"3","PostID":"30","UserID":"a010","Heading":"@Header Files","Content":"A header allows you to have access to a set of functions that is defined in that header. You can think of including a header as giving yourself access to a toolbox. This toolbox has ready to use functions that you do not have to write on your own. Headers are organised such that it satisfies the requirements of a particular domain. So you would have a header for pure math, a header for strings, a header for input and output, and a header for pre-written algorithms ect. More than one function can be \"contained\" in a header.","ParentPostID":"26","TimeStamp":"2013/02/28 15:32"},{"Level":"2","PostID":"31","UserID":"a005","Heading":"Lecture: 28/02/13","Content":"Today we discussed in the Afrikaans class \"ofstream\" which \"fstream\" declares as a data type.  Is the only usage of \"ofstream\" to output a file (text and numbers)?******Kind regards","ParentPostID":"7","TimeStamp":"2013/02/28 16:35"},{"Level":"2","PostID":"32","UserID":"a006","Heading":"Difference between abs(x) and fabs(x)?","Content":"Hi******Under the <cmath> header file I found that both functions abs(x) and fabs(x) can be used to get an absolute value.  Other than the fact that fabs(x) can be used to get an absolute value of a decimal number, are there any other differences between the two?","ParentPostID":"7","TimeStamp":"2013/02/28 16:52"},{"Level":"2","PostID":"33","UserID":"a005","Heading":"File input","Content":"If you want to input a file and you do not specify the path of the file.  Does C++ go and search for a file in the directory where your program is going to be executed and therefore input that file?******Kind regards","ParentPostID":"7","TimeStamp":"2013/02/28 16:58"},{"Level":"3","PostID":"34","UserID":"a008","Heading":"@ File input","Content":"As a defaukt, C++ uses the current file directory as the location as to where the file you want to open can be found. You are going to have to specify where the file can be located if it is not in the same file directory as the executable program.","ParentPostID":"33","TimeStamp":"2013/02/28 17:09"},{"Level":"2","PostID":"35","UserID":"a024","Heading":"Chapter 2: Quiz ( e.g. sum*=7 )","Content":"How do these types of calculations (plus the modulus (%) operator) work? An in-depth explanation would be greatly appreciated!","ParentPostID":"7","TimeStamp":"2013/02/28 18:59"},{"Level":"1","PostID":"36","UserID":"a025","Heading":"Click-UP TEST/QUIZ System","Content":"I'm wondering about how prone to human error that system is. I once did a quiz and definitely had 100, but it gave me 70. That was the first time, but not the only time. The only reason I'm not complaining yet is cause it doesn't count THAT much. I'm just concerned...******Anyone ever inquire about that?","ParentPostID":"1","TimeStamp":"2013/02/28 19:06"},{"Level":"2","PostID":"37","UserID":"a009","Heading":"Fstream.h","Content":"Greetings******Whilst ifstream only opens a file for input and ofstream opens a file for output, fstream.h gives simultaneous output and input through ifstream.******Regards","ParentPostID":"7","TimeStamp":"2013/02/28 19:51"},{"Level":"2","PostID":"38","UserID":"a009","Heading":"Algorithms","Content":"Hello******Although I know that algorithms is a sequence of instructions which result in solutions. Can anyone provide extra information on how we will incorporate algorithms in our programming?******Regards","ParentPostID":"7","TimeStamp":"2013/02/28 19:56"},{"Level":"1","PostID":"39","UserID":"a026","Heading":"confused","Content":"Why are we doing Imperative Programming with Mathematical Statistics?","ParentPostID":"1","TimeStamp":"2013/03/01 00:59"},{"Level":"2","PostID":"40","UserID":"a027","Heading":"ASCII","Content":"Hi everyone,***I know that ASCII is an encoding scheme and consists of 128 charecters numbered 0 through 127. When we write tests are we suppose to know, for example, that A is the 66th character etc.?","ParentPostID":"7","TimeStamp":"2013/03/01 01:44"},{"Level":"2","PostID":"41","UserID":"a028","Heading":"COS132 with Math Stats","Content":"I was wondering the same thing! It turns out that we will need it for our 2nd semester practicals. As you know at the moment we are using Excel in our WST practicals. But in the 2nd semester we will be using a program called SAS and","ParentPostID":"28","TimeStamp":"2013/03/01 10:57"},{"Level":"3","PostID":"42","UserID":"a028","Heading":"ASCII","Content":"@ Miss NM Matlou******I don't believe we will actually need to know the positions of each characters. You just need to know that each character in ASCII has a numerical position and that we may be asked to write a program that outputs the position of a ce","ParentPostID":"41","TimeStamp":"2013/03/01 11:03"},{"Level":"2","PostID":"43","UserID":"a010","Heading":"RE: using linux instead of windows excel","Content":"I use linux exclusively. Libre-office works fine for statistics. All the functions that we have used so far is available in Libre-office calc. I do not know about the graphing, but I suspect that it should be fine as well. Have a look on the net, there should be some good tuts available to help you adapt to the minor differences between calc and exel.","ParentPostID":"28","TimeStamp":"2013/03/01 12:05"},{"Level":"3","PostID":"44","UserID":"a010","Heading":"RE: Difference between abs(x) and fabs(x)?","Content":"As part of stdlib.h there are absolute functions for data-types int, long int and long long int. As part of math.h there is the functions fabs. The correct function should be used for a particular data-type. So if you want to find the absolute value of an int then use abs, if you want to find the absolute value of a float then use fabs. If you do not use the appropriate function, the compiler will complain and the program wont compile.","ParentPostID":"32","TimeStamp":"2013/03/01 12:19"},{"Level":"3","PostID":"45","UserID":"a010","Heading":"RE: Algorithms","Content":"At school you where taught how to calculate the GCD and LCM of 2 numbers. Your mathematics book showed you a set of steps that you need to follow in a particular order. That is an algorithm. Now if you need your program to calculate the GCD of 2 numbers then you need to write the algorithm in code and most likely make it a function called GCD() so that you could call it multiple times without rewriting it every time.","ParentPostID":"38","TimeStamp":"2013/03/01 12:27"},{"Level":"1","PostID":"46","UserID":"a029","Heading":"CS Honey","Content":"I'm not sure if everyone have noticed but it seems like the honey system is very slow when loading. Does anyone know a software that your browser load faster or any browser that loads the Honey system faster?","ParentPostID":"1","TimeStamp":"2013/03/01 14:00"},{"Level":"1","PostID":"47","UserID":"a010","Heading":"Thread creation","Content":"Why can we not create our own threads? Using one thread with multiple posts and topics is highly inefficient and disorganised.","ParentPostID":"1","TimeStamp":"2013/03/01 15:06"},{"Level":"1","PostID":"48","UserID":"a004","Heading":"Suggestion (Forum instead)","Content":"Hey there, wouldn't a forum be more practical and organized for the COS132. The discusion board is kinda messy to be honest. Constantly see the repost of the same topics. Forums also have a search function usually that makes it easier to check first if the problem your looking for has been handled. ***Like the forum -> http://mybroadband.co.za/vb/***for example.","ParentPostID":"1","TimeStamp":"2013/03/01 15:32"},{"Level":"1","PostID":"49","UserID":"a012","Heading":"Plagiarism","Content":"I attended the plagiarism session in the Library and it turns out that general knowledge might not be considered as plagiarism.Are formulars or codes you see on the internet or in books regarded as general knowledge since everyone might know about them? will the fact that it came from the internet or a book be regarded as plagiarism? If not, then what is regarded as general knowledge and what is not?","ParentPostID":"1","TimeStamp":"2013/03/01 17:27"},{"Level":"1","PostID":"50","UserID":"a023","Heading":"Getting 0","Content":"I would like to know if it is worth getting 0 for an assignment or question in a practical test for leaving out a space in your output?","ParentPostID":"3","TimeStamp":"2013/02/22 19:38"},{"Level":"2","PostID":"51","UserID":"a002","Heading":"Output must be exact","Content":"No but you will get 0 unless you type the code EXACTLY as the question requested.","ParentPostID":"50","TimeStamp":"2013/02/22 20:38"},{"Level":"2","PostID":"52","UserID":"a009","Heading":"Not only exact output required?","Content":"I find this uploading program to be a tad harsh. I am granted a zero for task five; even though my input and output match that of the instructions and my ouput displays floating values as instructed.","ParentPostID":"50","TimeStamp":"2013/02/25 16:00"},{"Level":"1","PostID":"53","UserID":"a016","Heading":"Minus 1","Content":"It has come to my attention that Fitchfolk is quite strict with its objectives. Every single task that I have completed has either given me full marks after multiple attempts or minus 1 and I am not to sure what the problem could be. Any tips would be much appreciated??","ParentPostID":"3","TimeStamp":"2013/02/25 16:01"},{"Level":"2","PostID":"54","UserID":"a015","Heading":"Possible causes of -1","Content":"I had the same problem for some of my tasks. There might be an error in your makefile. Make sure your specific executable file output is named exacty according to the practical instructions. Remember that Fitchfork analyses in a case sensitive","ParentPostID":"53","TimeStamp":"2013/02/25 19:26"},{"Level":"2","PostID":"55","UserID":"a023","Heading":"Executable not found","Content":"I tried uploading my Practical2 Task2 program; but every time I send it in to be marked I get -1 and an error message saying it can't find my executable. My makefile runs and produces the prac2task2 executable but Fitchfork can't seem to find it; any help would be much appreciated.","ParentPostID":"53","TimeStamp":"2013/02/26 11:53"},{"Level":"1","PostID":"56","UserID":"a023","Heading":"Not getting full marks","Content":"When uploading practical 2 task 2 and task 5; Fitchfork keeps giving me a mark one less than the total. I have made various attempts and get the exact prescriped output but the results remain the same. Could anyone advice me on this issue?","ParentPostID":"3","TimeStamp":"2013/02/26 11:58"},{"Level":"2","PostID":"57","UserID":"a005","Heading":"Spelling errors","Content":"For missing marks on Fitchfork just check to make sure there are no spelling errors or small syntax/semantic errors that could be causing you to lose the mark. This was one of the problems i had and when i changed the error i got full marks.","ParentPostID":"56","TimeStamp":"2013/02/26 13:18"},{"Level":"2","PostID":"58","UserID":"a009","Heading":"Wrong marks in PDF","Content":"My marks for Practical 2 Task 2 & 5 are also only 1 mark less than full marks; even though everything seemed to be working perfectly (including things like spacing and calculations). I asked one of the tutors to look at it and he could not find anything wrong. He also that it might be that the totals in the Practical2 pdf file could be wrong; since he recalled that Task 2 might actually count out of 5 instead of 6.******If anyone could verify that this might be the case; it would be much appreciated!","ParentPostID":"56","TimeStamp":"2013/02/26 14:58"},{"Level":"1","PostID":"59","UserID":"a002","Heading":"File too big","Content":"Apparently; Fitchfork is not uploading my Prac2task5 because it is too big! What could be the problem and how can i go about it?","ParentPostID":"3","TimeStamp":"2013/02/26 17:06"},{"Level":"3","PostID":"60","UserID":"a001","Heading":"Task 5","Content":"I verified that the maximum marks that can be awarded for Prac 2 Task 5 is reported correctly in the PDF.","ParentPostID":"58","TimeStamp":""},{"Level":"4","PostID":"61","UserID":"a008","Heading":"Confirmed Task 5","Content":"You can get 10 out of 10 for Practical 2 task 5. The problem lies in the output.","ParentPostID":"60","TimeStamp":"2013/02/27 10:44"},{"Level":"4","PostID":"62","UserID":"a034","Heading":"RE : Prac2task5","Content":"Yes it works. I investigated the output and changed a bit around and I have recieved 10 out of 10 for task5. Just play around and you will solve it.","ParentPostID":"60","TimeStamp":"2013/02/27 10:56"},{"Level":"2","PostID":"63","UserID":"a008","Heading":"content of tarball","Content":"You only compress the makefile and cpp file in your tar file that you are uplaoding and you leave the rest of the files(object file; executable file) out.","ParentPostID":"59","TimeStamp":"2013/02/27 12:27"},{"Level":"3","PostID":"64","UserID":"a017","Heading":"file names matter","Content":"I had the same problem. make sure in the tar comand you include both your makefile and the task2.cpp file. Also recheck the spalling of the executable created with your makefile.","ParentPostID":"55","TimeStamp":"2013/02/27 12:38"},{"Level":"2","PostID":"65","UserID":"a017","Heading":"Compressing content","Content":"You should check that in the tar comand you included the -z flag.***Without this flag your tarball does not get compressed. :-)***","ParentPostID":"59","TimeStamp":"2013/02/27 12:41"},{"Level":"2","PostID":"66","UserID":"a003","Heading":"Prac2 task5","Content":"I have received 6 out of 10 for my task 5 of the 2nd practical. The program gives the correct output and asks for the correct inputs too. Can anyone please advice me on what I should do . Thanks.","ParentPostID":"56","TimeStamp":"2013/02/27 13:45"},{"Level":"1","PostID":"67","UserID":"a024","Heading":"Possible Solution to Fitchfork criteria?","Content":"I have a question; does the program only grade your output or does it grade the actual code you upload?******If it marks the code as well; wouldn't it be fairer to have criteria for multiple solutions?******EG: The question asks you to sort the data in alphabetical order and the criteria marks only for a bubble sort but the candidate uses a more efficient insertion sort but does not receive any marks but achieves the same result in a more elegant manner?","ParentPostID":"3","TimeStamp":"2013/02/27 14:00"},{"Level":"1","PostID":"68","UserID":"a025","Heading":"Which attempt counts?","Content":"I would like to find out if Fitchfork takes your best attempt; when uploading a program; or does it take your last attempt?***","ParentPostID":"3","TimeStamp":"2013/02/27 16:13"},{"Level":"2","PostID":"69","UserID":"a009","Heading":"Best mark counts","Content":"As far as i know; it takes your best mark from all your attempts;else i cant see the point of having multiple attempts if you can drop your mark.","ParentPostID":"68","TimeStamp":"2013/02/27 17:33"},{"Level":"2","PostID":"70","UserID":"a027","Heading":"Why negative?","Content":"I got a minus 1 for the first practical.Why does ficthfork mark negatively?Is there any way to cancel such a bad mark in future practicals?***","ParentPostID":"53","TimeStamp":"2013/02/27 18:57"},{"Level":"2","PostID":"71","UserID":"a021","Heading":"How fitchfork assess","Content":"To all that are having trouble with Fitchfork (in terms of not getting full marks): Just keep in mind that Fitchfork doesn't look at your code at all. It runs the executable; gives it some random but applicable input; and then analyzes the output to see if it matches that expected output exactly. ******If one letter's case is wrong; or there is one space where there wasn't supposed to be one; it will deduct marks. Read the instructions carefully; and make sure your output corresponds exactly with what was required.","ParentPostID":"56","TimeStamp":"2013/02/28 10:24"},{"Level":"2","PostID":"72","UserID":"a034","Heading":"Additional tips","Content":"First you must make sure that your program output exactly the same results as asked (correct spacing; using upper/lower case; colons where needed; know where and when to put endl command etc.). Pay attention to your makefile and make sure you have the right executable file as required from a particular task.","ParentPostID":"56","TimeStamp":"2013/02/28 12:17"},{"Level":"2","PostID":"73","UserID":"a027","Heading":"Tip to avoid negative mark","Content":"Unfortunately to avoid Fitchfork giving you negative marking make sure that your program is running correctly in the terminal.If so compile it and it should give the right marks.***All the best","ParentPostID":"53","TimeStamp":"2013/02/28 12:20"},{"Level":"3","PostID":"74","UserID":"a014","Heading":"Task 2","Content":"The practical2 pdf file states that task2 is out of 6 however; everyboy I know including myself got 5/6. I would love to know if there is a mistake in the pdf file or there is something wrong with our codes?","ParentPostID":"58","TimeStamp":"2013/02/28 13:01"},{"Level":"1","PostID":"75","UserID":"a011","Heading":"Deleting wrong uploaded tasks","Content":"Hello everyone how to I remove the wrong or incorrect tasks?","ParentPostID":"3","TimeStamp":"2013/02/28 13:36"},{"Level":"2","PostID":"76","UserID":"a022","Heading":"Deteting uploads not possible","Content":"You can't remove a wrong task - you merely have a certain number of chances to upload the task; so i d suggest you revisit your code and makefile compilation to find any errors and upload that version of your task.","ParentPostID":"75","TimeStamp":"2013/02/28 13:40"},{"Level":"1","PostID":"77","UserID":"a032","Heading":"Uploading Tasks","Content":"I can't upload my tasks because the uploading links do not appear on my cs portal.What should i do?","ParentPostID":"3","TimeStamp":"2013/02/28 14:04"},{"Level":"4","PostID":"78","UserID":"a010","Heading":"Task 2 total IS 5","Content":"Yes; Task 2 only counts 5 marks - I verified it with Mrs Vreda Pieterse on Tuesday.","ParentPostID":"74","TimeStamp":"2013/02/28 14:13"},{"Level":"2","PostID":"79","UserID":"a022","Heading":"Marks","Content":"Just wondering; does your highest mark overall for each task get counted; as with attempted quizzes on ClickUP; or does the most recently uploaded task's mark count?","ParentPostID":"68","TimeStamp":"2013/02/28 14:27"},{"Level":"1","PostID":"80","UserID":"a033","Heading":"Fitchfork marks","Content":"I would like to gain some information on why Fitchfork does not give the total marks for our Practical tasks; meaning what our Practicals are out of. This is necessary for us to know whether we scored full marks and if not; how many marks we lost.","ParentPostID":"3","TimeStamp":"2013/02/28 14:36"},{"Level":"2","PostID":"81","UserID":"a033","Heading":"most recent or best?","Content":"Does fitchfork take our most recent upload or our upload with the highest mark for our practical tasks?","ParentPostID":"68","TimeStamp":"2013/02/28 14:38"},{"Level":"3","PostID":"82","UserID":"a026","Heading":"Task 3","Content":"I would like to ask if Task 3 is out of four or five marks?","ParentPostID":"58","TimeStamp":"2013/02/28 14:46"},{"Level":"2","PostID":"83","UserID":"a006","Heading":"what am I doing wrong?","Content":"Im getting have the mark for prac2task5 what could possible be the problem?","ParentPostID":"56","TimeStamp":"2013/02/28 17:20"},{"Level":"2","PostID":"84","UserID":"a006","Heading":"what am I doing wrong?","Content":"Im getting have the mark for prac2task5 what could possible be the problem?","ParentPostID":"56","TimeStamp":"2013/02/28 17:20"},{"Level":"1","PostID":"85","UserID":"a020","Heading":"Checking and correcting mistakes","Content":"When you submit your practical assingment;for example prac2task4;and you find that you didn't get the full marks;is there any other way in which fitchfork can tell you where you made a mistake?","ParentPostID":"3","TimeStamp":"2013/02/28 19:10"},{"Level":"2","PostID":"86","UserID":"a035","Heading":"Login required","Content":"Probably is because you didnt log on the CS website.If you logged on and it still doesnt appear; then its administration issues.","ParentPostID":"77","TimeStamp":"2013/02/28 18:57"},{"Level":"2","PostID":"87","UserID":"a033","Heading":"Fitchfork not accurate","Content":"I also doubt the accuracy of Fitchfork. Sometimes -1. sometimes the most you get is -1 from the maximum marks; no matter what you do.******And the \"output should be exact\" thing; takes away from being creative a bit...","ParentPostID":"67","TimeStamp":"2013/02/28 19:01"},{"Level":"2","PostID":"88","UserID":"a004","Heading":"Task 5: The T.A. said it counts 9!","Content":"Calm down eveyone with 9s for Task 5; the T.A. said that it will count 9 NOT 10.","ParentPostID":"56","TimeStamp":"2013/02/28 19:02"},{"Level":"3","PostID":"89","UserID":"a035","Heading":"Meaning of -1 = Errors","Content":"The negetive one simply means that there is something wrong with your code(either it doesnt run-syntax errors or the output is different-sementic errors).Id advise you to look at yor code carefully and make sure it executes and gives you t","ParentPostID":"70","TimeStamp":"2013/02/28 19:04"},{"Level":"1","PostID":"90","UserID":"a020","Heading":"Checking and correcting mistakes","Content":"When you submit your practical assingment;for example prac2task4;and you find that you didn't get the full marks;is there any other way in which fitchfork can tell you where you made a mistake?","ParentPostID":"3","TimeStamp":"2013/02/28 19:10"},{"Level":"4","PostID":"91","UserID":"a033","Heading":"marks wrong?","Content":"I am also getting 5 instead of 6 on my practical 2 Task 2","ParentPostID":"74","TimeStamp":"2013/02/28 19:36"},{"Level":"3","PostID":"92","UserID":"a006","Heading":"Possible to get 10 out of 10 for task 5","Content":"Good Afternoon Everyone******Many of you have been getting 9 out of 10 for practical 2 task 5. I too got 9 originally however it seems there is a mistake with the Fitchfork memo; hence the 9 out of 10. To get 10 out of 10; you need to intentionally make a spelling error in your program. If you spell 'Celsius' with another 'c' instead of a 's' (i.e Celcius) you should get full marks if everything else is correct. Take care to change all Celsius to Celcius. I have tried this and it does work. Regards","ParentPostID":"56","TimeStamp":"2013/02/28 19:43"},{"Level":"3","PostID":"93","UserID":"a007","Heading":"Memo spelling error","Content":"I also received 9 out 10 for task 5 of practical 2. In terms of making a spelling mistake on purpose; would we be penalised for not adhering to coding standards? It is amazing that anyone managed to figure that out. Thank you for letting us know.","ParentPostID":"92","TimeStamp":"2013/02/28 19:55"},{"Level":"2","PostID":"94","UserID":"a019","Heading":"Fellow Programmers...","Content":"To all those who are still struggling with getting full marks. There is only just one observation I made; Fitchfork is very specific. So; if you can try and practise the skill of following instructions success will be guaranteed.","ParentPostID":"56","TimeStamp":"2013/02/28 20:08"},{"Level":"1","PostID":"95","UserID":"a022","Heading":"Fast but much too strict","Content":"In principle fitchfork is awesome imo (I hate waiting for marks). In practice though it's annoying because it's nigh near impossible to get full marks sometimes; even if your program does EXACTLY what the instructions said it should. At least a human you can reason with.","ParentPostID":"3","TimeStamp":"2013/02/28 20:15"},{"Level":"2","PostID":"96","UserID":"a031","Heading":"Highest mark counts","Content":"Fitchfork takes your highest mark.  It does not take an average of all your marks nor the last mark assigned.******Thus do not worry if you got low marks before or after receiving a high mark.  Only your best mark will count.******Kind regards","ParentPostID":"68","TimeStamp":"2013/02/28 20:15"},{"Level":"2","PostID":"97","UserID":"a024","Heading":"Different ways of opening files","Content":"In the lecture today; for example; the professor said there more than one way to open and read a file using C++. Now if we use another way than what fitchfork marks; then we will get 0 marks. Fitchfork is extremely strict.","ParentPostID":"67","TimeStamp":"2013/02/28 20:18"},{"Level":"2","PostID":"98","UserID":"a031","Heading":"Marking of parctical exam","Content":"Fithfork should not be used to mark our practical exams; because of the reason you have given.  You can use your own logic and program skills to solve the problems they give in the exams.******Kind regards","ParentPostID":"67","TimeStamp":"2013/02/28 20:27"},{"Level":"2","PostID":"99","UserID":"a016","Heading":"Feedback needed","Content":"Why is it that when you submit your work and it doesn't get a total the program doesn't tell you what you did wrong? How are we supposed to know how to fix it?","ParentPostID":"90","TimeStamp":"2013/02/28 21:34"},{"Level":"3","PostID":"100","UserID":"a017","Heading":"Fitchfork should tell you what you did wrong","Content":"Why does fitchfork give negative marks even though my program was compiled and executed succesfully? And it doesn't tell me what I did wrong","ParentPostID":"70","TimeStamp":"2013/02/28 21:35"},{"Level":"4","PostID":"101","UserID":"a032","Heading":"I get 0 for Task 2","Content":"i'm getting zero for my outputs in task 2 even though they are declared correctly;can there be any assistance to help me because i've tried it several times with different codes and nothing seems to be working","ParentPostID":"74","TimeStamp":"2013/02/28 21:38"},{"Level":"3","PostID":"102","UserID":"a031","Heading":"Is it me or FF that’s wrong?","Content":"I have a problem getting full marks for my task 5; I have done my task several times but I keep getting 9/10.I'm quite sure that i've done everything correctly. Could fitchfork be the problem to my concern ?","ParentPostID":"56","TimeStamp":"2013/02/28 22:08"},{"Level":"1","PostID":"103","UserID":"a018","Heading":"From bad to worse","Content":"I was doing practical2 task3 and i got 3 over 4; so I went back to my program to try to fix it up. It turned out that I didnt put spaces after my colons. I uploaded it on Fitchfork again only to get -1 and a whole screen written error repeatedly. Im now confused more than ever. What do you think is wrong with my program:-(.","ParentPostID":"3","TimeStamp":"2013/02/28 22:36"},{"Level":"3","PostID":"104","UserID":"a006","Heading":"Re: Feedback needed","Content":"I agree! When i compile my programme it states that i have no mistakes but when i upload it to Fitchfork; I got a mark of 1 for my fourth task; I do not understand how should i check my errors to get a better mark?","ParentPostID":"99","TimeStamp":"2013/02/28 22:40"},{"Level":"3","PostID":"105","UserID":"a035","Heading":"Have the marks?","Content":"What do you mean \"have\" the mark? there's no \"have\" mark that a person can get on fitchfork that I know of.","ParentPostID":"83","TimeStamp":"2013/02/28 22:43"},{"Level":"3","PostID":"106","UserID":"a028","Heading":"Re: Not only exact output required?","Content":"Your output however accurate it may look; so long the logic does not comply with fitchfork marking rules you may even get a negative mark. Try rearranging the statements in your .cpp into a somewhat order then try and upload again.","ParentPostID":"52","TimeStamp":"2013/03/01 01:08"},{"Level":"2","PostID":"107","UserID":"a028","Heading":"Fitchfork is a program itself","Content":"Indeed fitchfork is strict because it is a computer program and follows predetermined rules and procedures. The best to do is to play around with the .cpp as this is were most marks come from.","ParentPostID":"53","TimeStamp":"2013/03/01 01:11"},{"Level":"3","PostID":"108","UserID":"a028","Heading":"Re:  Prac2 Task5","Content":"You should try and rearrange your code in the .cpp . If your logic is correct you will definitely get a mark higher than 6.","ParentPostID":"66","TimeStamp":"2013/03/01 01:18"},{"Level":"2","PostID":"109","UserID":"a028","Heading":"Fitchfork marks","Content":"If you get a mark lower than the mark for your previous attempt; does fitchfork use the previous higher mark or does it keep the current low mark? I want to try some of my practicals again but I am afraid I will get lower marks.","ParentPostID":"68","TimeStamp":"2013/03/01 01:54"},{"Level":"3","PostID":"110","UserID":"a014","Heading":"Fitchfork Marks","Content":"As far as I understand Fitchfork takes the last mark. You have multiple attempts so if you do; do worse you can always re-submit your previous task as long as it wasn't your last attempt.","ParentPostID":"109","TimeStamp":"2013/03/01 02:07"},{"Level":"3","PostID":"111","UserID":"a030","Heading":"Why Fitchfork Gives -1","Content":"When something goes wrong with an upload before Fitchfork can even start testing it; you get a mark of -1. In other words when Fitchfork gives you -1; it is to tell you that an error has occurred; not to subtract from your marks.******This happens when Fitchfork cannot compile your program; or when your makefile creates an executable program with the wrong name. (If the spec says your program must be named task2 and your makefile creates a program called task1 instead; you will get -1)******Note that when you get -1; we regard it as a 0. The lowest mark you can get is 0.","ParentPostID":"70","TimeStamp":"2013/03/01 12:55"},{"Level":"2","PostID":"112","UserID":"a030","Heading":"Practical 2: Total Marks Issues","Content":"Task 2 and 5 of Practical 2 have issues with total marks. All other tasks are correct.******The issue with Task 2 is that the spec says it counts 6; but it only counts 5 on Fitchfork. If you receive 5 marks; you have full marks.******The issue with Task 5 is a spelling mistake in the memo (as Ms K Coetzee correctly posted in this discussion yesterday). As this is our mistake; those who received 9/10 will be bumped up to 10.","ParentPostID":"56","TimeStamp":"2013/03/01 13:08"},{"Level":"1","PostID":"113","UserID":"a012","Heading":"aploading prac2 task4","Content":"I created a makefile for Practical2 task4; I typed the exact output code and my program is running but Fitchfork is giving me -1.Why?***","ParentPostID":"3","TimeStamp":"2013/03/01 18:22"}]